name: "tiny_llm_onnx"
platform: "onnxruntime_onnx"
max_batch_size: 8

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1 ]
  }
]

output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [ -1, 65 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]